INSERT INTO students (name, kana_name, nickname, email, area, age, sex, remark, deleted) VALUES
     ('中村悠斗', 'ナカムラユウト', 'ユウト', 'yuto.nakamura@example.com', '神奈川', 26, '男性', 'Java Silver取得を目指して学習中', 0),
     ('小林さくら', 'コバヤシサクラ', 'サクラ', 'sakura.kobayashi@example.com', '京都', 23, '女性', 'フロントエンドに興味あり', 0),
     ('井上拓海', 'イノウエタクミ', 'タクミ', 'takumi.inoue@example.com', '広島', 29, '男性', '転職活動と並行して勉強中', 0),
     ('松本結衣', 'マツモトユイ', 'ユイ', 'yui.matsumoto@example.com', '愛知', 21, '女性', 'Web制作の基礎から学びたい', 0),
     ('藤田健', 'フジタケン', 'ケン', 'ken.fujita@example.com', '兵庫', 32, '男性', 'データベース設計に興味あり', 0);

INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at) VALUES
    (1,  'Java基礎コース',         '2026-04-20 10:00:00', '2026-10-20 18:00:00'),
    (2,  'Web開発コース',          '2026-04-21 10:00:00', '2026-10-21 18:00:00'),
    (5,  'データベースコース',      '2026-04-22 10:00:00', '2026-10-22 18:00:00'),
    (1,  'AWSフルコース',          '2026-04-23 10:00:00', '2026-10-23 18:00:00'),
    (3,  'AWSフルコース',          '2026-04-23 10:00:00', '2026-10-23 18:00:00'),
    (1, 'AIプログラミングコース',  '2026-04-24 10:00:00', '2026-10-24 18:00:00'),
    (4,'Java応用コース',         '2026-04-25 10:00:00', '2026-10-25 18:00:00'),
    (2,'Python基礎コース',       '2026-04-26 10:00:00', '2026-10-26 18:00:00');